{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sesr/p_re_lu_4/Neg", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_3/Neg", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_2/Neg", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_1/Neg", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu/Neg", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_1/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_2/add", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_3/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_4/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_5/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_6/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/sub", "op": "Sub", "input": ["input_1", "StatefulPartitionedCall/sesr/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sesr/sub", "StatefulPartitionedCall/sesr/linear_block_c/add"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sesr/linear_block_c/Conv2D", "StatefulPartitionedCall/sesr/linear_block_c_1/add"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu/Relu", "op": "Prelu", "input": ["StatefulPartitionedCall/sesr/linear_block_c_1/Conv2D", "StatefulPartitionedCall/sesr/p_re_lu/Neg"]}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sesr/p_re_lu/Relu", "StatefulPartitionedCall/sesr/linear_block_c_2/add"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_1/Relu", "op": "Prelu", "input": ["StatefulPartitionedCall/sesr/linear_block_c_2/Conv2D", "StatefulPartitionedCall/sesr/p_re_lu_1/Neg"]}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sesr/p_re_lu_1/Relu", "StatefulPartitionedCall/sesr/linear_block_c_3/add"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_2/Relu", "op": "Prelu", "input": ["StatefulPartitionedCall/sesr/linear_block_c_3/Conv2D", "StatefulPartitionedCall/sesr/p_re_lu_2/Neg"]}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_4/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sesr/p_re_lu_2/Relu", "StatefulPartitionedCall/sesr/linear_block_c_4/add"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_3/Relu", "op": "Prelu", "input": ["StatefulPartitionedCall/sesr/linear_block_c_4/Conv2D", "StatefulPartitionedCall/sesr/p_re_lu_3/Neg"]}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_5/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sesr/p_re_lu_3/Relu", "StatefulPartitionedCall/sesr/linear_block_c_5/add"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sesr/linear_block_c_5/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_4/Neg_1", "op": "Neg", "input": ["StatefulPartitionedCall/sesr/linear_block_c_5/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_4/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/sesr/p_re_lu_4/Neg_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_4/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sesr/p_re_lu_4/Neg", "StatefulPartitionedCall/sesr/p_re_lu_4/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddN", "input": ["StatefulPartitionedCall/sesr/p_re_lu_4/Relu", "StatefulPartitionedCall/sesr/p_re_lu_4/mul", "StatefulPartitionedCall/sesr/linear_block_c/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_6/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sesr/ArithmeticOptimizer/AddOpsRewrite_add", "StatefulPartitionedCall/sesr/linear_block_c_6/add"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sesr/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sesr/linear_block_c_6/Conv2D", "input_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sesr/DepthToSpace", "op": "DepthToSpace", "input": ["StatefulPartitionedCall/sesr/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "block_size": {"i": "2"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sesr/DepthToSpace"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sesr/p_re_lu_4/Neg", "shape": [1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_3/Neg", "shape": [1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_2/Neg", "shape": [1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/p_re_lu_1/Neg", "shape": [1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/p_re_lu/Neg", "shape": [1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_1/add", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_2/add", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_3/add", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_4/add", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_5/add", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/linear_block_c/add", "shape": [5, 5, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sesr/linear_block_c_6/add", "shape": [5, 5, 16, 4], "dtype": "float32"}]}]}